2022-10-17-buildroot-kernel-module-tutor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org6ddb20b" class="outline-2">
<h2 id="org6ddb20b">use buildroot develop linux kernel module</h2>
<div class="outline-text-2" id="text-org6ddb20b">
</div>
<div id="outline-container-org84a67f4" class="outline-3">
<h3 id="org84a67f4">prepare buildroot source tree</h3>
<div class="outline-text-3" id="text-org84a67f4">
<div class="org-src-container">
<pre class="src src-shell"><code>git clone https://git.buildroot.net/buildroot</code>
<code>cd buildroot</code>
<code>git checkout 2022.08.1 # checkout a stable version</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea694b7" class="outline-3">
<h3 id="orgea694b7">create directory</h3>
<div class="outline-text-3" id="text-orgea694b7">
<div class="org-src-container">
<pre class="src src-shell"><code>mkdir package/lkhello</code>
<code>mkdir package/lkhello/src</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge9a8007" class="outline-3">
<h3 id="orge9a8007">add Config.in</h3>
<div class="outline-text-3" id="text-orge9a8007">
<div class="org-src-container">
<pre class="src src-shell"><code>$EDITOR package/lkhello/Config.in</code>
</pre>
</div>

<p>
write:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>config BR2_PACKAGE_LKHELLO</code>
<code>	bool "lkhello"</code>
<code>	depends on BR2_LINUX_KERNEL</code>
<code>	help</code>
<code>	 linux kernel hello</code>
<code></code>
<code>comment "lkhello needs a Linux kernel to be built"</code>
<code>	depends on !BR2_LINUX_KERNEL	  </code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org57cf175" class="outline-3">
<h3 id="org57cf175">add lkhello.mk</h3>
<div class="outline-text-3" id="text-org57cf175">
<div class="org-src-container">
<pre class="src src-shell"><code>$EDITOR package/lkhello/lkhello.mk</code>
</pre>
</div>

<p>
write:
</p>

<div class="org-src-container">
<pre class="src src-makefile"><code>################################################################################</code>
<code>#</code>
<code># lkhello</code>
<code>#</code>
<code>################################################################################</code>
<code></code>
<code>LKHELLO_VERSION = 0.1</code>
<code>LKHELLO_SITE = "$(TOPDIR)/package/lkhello/src"</code>
<code>LKHELLO_SITE_METHOD = local</code>
<code>LKHELLO_MODULE_MAKE_OPTS = CONFIG_LKHELLO=m</code>
<code></code>
<code>$(eval $(kernel-module))</code>
<code>$(eval $(generic-package))</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1033f09" class="outline-3">
<h3 id="org1033f09">write module</h3>
<div class="outline-text-3" id="text-org1033f09">
<p>
add Kconfig
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>$EDITOR package/lkhello/src/Kconfig</code>
</pre>
</div>

<p>
write:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>menuconfig LKHELLO</code>
<code>	tristate "linux kernel helloworld"</code>
</pre>
</div>


<p>
add Makefile
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>$EDITOR package/lkhello/src/Makefile</code>
</pre>
</div>

<p>
write:
</p>

<div class="org-src-container">
<pre class="src src-text"><code>obj-m := lkhello.o</code>
</pre>
</div>


<p>
add lkhello.c
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>$EDITOR package/lkhello/src/Makefile</code>
</pre>
</div>

<p>
write:
</p>

<div class="org-src-container">
<pre class="src src-c"><code>#include &lt;linux/init.h&gt;</code>
<code>#include &lt;linux/module.h&gt;</code>
<code></code>
<code>MODULE_LICENSE("Dual BSD/GPL");</code>
<code></code>
<code>static int lkhello_init(void) {</code>
<code>	printk(KERN_ALERT "Hello, World\n");</code>
<code>	return 0;</code>
<code>}</code>
<code></code>
<code>static void lkhello_exit(void) {</code>
<code>	printk(KERN_ALERT "Bye, World\n");</code>
<code>}</code>
<code></code>
<code>module_init(lkhello_init);</code>
<code>module_exit(lkhello_exit);</code>
</pre>
</div>
</div>
</div>


<div id="outline-container-org2f376a6" class="outline-3">
<h3 id="org2f376a6">add to buildroot menu</h3>
<div class="outline-text-3" id="text-org2f376a6">
<div class="org-src-container">
<pre class="src src-shell"><code>$EDITOR package/Config.in</code>
</pre>
</div>

<p>
add something like other package&rsquo;s define:
</p>

<div class="org-src-container">
<pre class="src src-diff"><code>--- a/package/Config.in</code>
<code>+++ b/package/Config.in</code>
<code>@@ -2680,4 +2680,8 @@ menu "Text editors and viewers"</code>
<code>	source "package/vim/Config.in"</code>
<code> endmenu</code>
<code></code>
<code>+menu "my packages"</code>
<code>+	source "package/lkhello/Config.in"</code>
<code>+endmenu</code>
<code>+</code>
<code> endmenu</code>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8ddf5d3" class="outline-2">
<h2 id="org8ddf5d3">all is done</h2>
<div class="outline-text-2" id="text-org8ddf5d3">
<p>
all is done, now you can select &rsquo;lkhello&rsquo; use:
</p>

<div class="org-src-container">
<pre class="src src-shell"><code>make menuconfig</code>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text"><code>Target packages  ---&gt;</code>
<code>	 my packages  ---&gt;</code>
<code>		[*] lkhello   </code>
</pre>
</div>

<p>
select lkhello and compile firmware.
</p>

<p>
boot up firmware.
</p>

<p>
and &rsquo;modprobe lkhello&rsquo; to print a &rsquo;Hello, World&rsquo; in kernel log
</p>

<p>
use &rsquo;rmmod lkhello&rsquo; to print a &rsquo;Bye, World&rsquo; in kernel log
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last updated: 2022-12-03</p>
</div>
</body>
</html>
